Revit 2024 API
PlanCircuitSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	PlanCircuit item
)
Visual Basic
Public Overridable Function Erase ( _
	item As PlanCircuit _
) As Integer
Visual C++
public:
virtual int Erase(
	PlanCircuit^ item
)
Parameters
item
Type: Autodesk.Revit.DB.PlanCircuit
The item to be erased.
Return Value
The number of items that were erased from the set.
See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace